qmk/qmk_firmware/tmk_core/tool/mbed/mbed-sdk/libraries/mbed/targets/cmsis/TARGET_STM/TARGET_STM32L0/stm32l0xx_hal_usart.h
#define   HAL_USART_ERROR_NONE      ((uint32_t)0x00)    /*!< No error            */
#define   HAL_USART_ERROR_PE        ((uint32_t)0x01)    /*!< Parity error        */
#define   HAL_USART_ERROR_NE        ((uint32_t)0x02)    /*!< Noise error         */
#define   HAL_USART_ERROR_FE        ((uint32_t)0x04)    /*!< frame error         */
#define   HAL_USART_ERROR_ORE       ((uint32_t)0x08)    /*!< Overrun error       */
#define   HAL_USART_ERROR_DMA       ((uint32_t)0x10)    /*!< DMA transfer error  */

/**
  * @}
  */
/** @defgroup USART_Clock_SourceDefinition  USART clock source definition
  * @{
  */
/** 
  * @brief  USART clock sources definitions
  */
typedef enum
{
  USART_CLOCKSOURCE_PCLK1      = 0x00,    /*!< PCLK1 clock source  */
  USART_CLOCKSOURCE_PCLK2      = 0x01,    /*!< PCLK2 clock source  */
  USART_CLOCKSOURCE_HSI        = 0x02,    /*!< HSI clock source    */
  USART_CLOCKSOURCE_SYSCLK     = 0x04,    /*!< SYSCLK clock source */
  USART_CLOCKSOURCE_LSE        = 0x08     /*!< LSE clock source     */
}USART_ClockSourceTypeDef;
/**
  * @}
  */
/** @defgroup USART_handle_Definition  Handle structure definition
  * @{
  */
/** 
  * @brief  USART handle Structure definition  
  */

typedef struct
{
  USART_TypeDef                 *Instance;        /*!<  USART registers base address        */

  USART_InitTypeDef             Init;             /*!<  Usart communication parameters      */
  
  uint8_t                       *pTxBuffPtr;      /*!<  Pointer to Usart Tx transfer Buffer */
  
  uint16_t                      TxXferSize;       /*!<  Usart Tx Transfer size              */
  
  __IO uint16_t                 TxXferCount;      /*!<  Usart Tx Transfer Counter           */
  
  uint8_t                       *pRxBuffPtr;      /*!<  Pointer to Usart Rx transfer Buffer */
  
  uint16_t                      RxXferSize;       /*!<  Usart Rx Transfer size              */
  
  __IO uint16_t                 RxXferCount;      /*!<  Usart Rx Transfer Counter           */

  uint16_t                      Mask;             /* USART Rx RDR register mask             */  
  
  DMA_HandleTypeDef             *hdmatx;          /*!<  Usart Tx DMA Handle parameters      */
    
  DMA_HandleTypeDef             *hdmarx;          /*!<  Usart Rx DMA Handle parameters      */
  
  HAL_LockTypeDef                Lock;            /*!<  Locking object                      */
  
  __IO HAL_USART_StateTypeDef    State;           /*!<  Usart communication state           */
  
  __IO uint32_t                  ErrorCode;       /*!<  USART Error code                    */
  
}USART_HandleTypeDef;
/**
  * @}
  */
/**
  * @}
  */

/* Exported constants --------------------------------------------------------*/
/** @defgroup USART_Exported_Constants USART Exported Constants
  * @{
  */

/** @defgroup USART_Stop_Bits USART stop bit definition
  * @{
  */
#define USART_STOPBITS_1                     ((uint32_t)0x0000)
#define USART_STOPBITS_0_5                   ((uint32_t)USART_CR2_STOP_0)
#define USART_STOPBITS_2                     ((uint32_t)USART_CR2_STOP_1)
#define USART_STOPBITS_1_5                   ((uint32_t)(USART_CR2_STOP_0 | USART_CR2_STOP_1))
#define IS_USART_STOPBITS(STOPBITS) (((STOPBITS) == USART_STOPBITS_1) || \
                                         ((STOPBITS) == USART_STOPBITS_0_5) || \
                                         ((STOPBITS) == USART_STOPBITS_1_5) || \
                                         ((STOPBITS) == USART_STOPBITS_2))
/**
  * @}
  */ 

/** @defgroup USART_Parity USART parity definition
  * @{
  */ 
#define USART_PARITY_NONE                    ((uint32_t)0x0000)
#define USART_PARITY_EVEN                    ((uint32_t)USART_CR1_PCE)
#define USART_PARITY_ODD                     ((uint32_t)(USART_CR1_PCE | USART_CR1_PS)) 
#define IS_USART_PARITY(PARITY) (((PARITY) == USART_PARITY_NONE) || \
                                     ((PARITY) == USART_PARITY_EVEN) || \
                                     ((PARITY) == USART_PARITY_ODD))
/**
  * @}
  */ 

/** @defgroup USART_Mode USART mode definition
  * @{
  */ 
#define USART_MODE_RX                        ((uint32_t)USART_CR1_RE)
#define USART_MODE_TX                        ((uint32_t)USART_CR1_TE)
#define USART_MODE_TX_RX                     ((uint32_t)(USART_CR1_TE |USART_CR1_RE))
#define IS_USART_MODE(MODE)     (((MODE) == USART_MODE_RX) || \
                                 ((MODE) == USART_MODE_TX) || \
                                 ((MODE) == USART_MODE_TX_RX))
/**
  * @}
  */
    
/** @defgroup USART_Clock USART clock activation definition
  * @{
  */ 
#define USART_CLOCK_DISABLE                 ((uint32_t)0x0000)
#define USART_CLOCK_ENABLE                  ((uint32_t)USART_CR2_CLKEN)
#define IS_USART_CLOCK(CLOCK)      (((CLOCK) == USART_CLOCK_DISABLE) || \
                                   ((CLOCK) == USART_CLOCK_ENABLE))
/**
  * @}
  */ 

/** @defgroup USART_Clock_Polarity USART polarity level definition
  * @{
  */
#define USART_POLARITY_LOW                   ((uint32_t)0x0000)
#define USART_POLARITY_HIGH                  ((uint32_t)USART_CR2_CPOL)
#define IS_USART_POLARITY(CPOL) (((CPOL) == USART_POLARITY_LOW) || ((CPOL) == USART_POLARITY_HIGH))
/**
  * @}
  */ 

/** @defgroup USART_Clock_Phase USART clock phase definition
  * @{
  */
#define USART_PHASE_1EDGE                    ((uint32_t)0x0000)
#define USART_PHASE_2EDGE                    ((uint32_t)USART_CR2_CPHA)
#define IS_USART_PHASE(CPHA) (((CPHA) == USART_PHASE_1EDGE) || ((CPHA) == USART_PHASE_2EDGE))
/**
  * @}
  */

/** @defgroup USART_Last_Bit USART last bit activation definition
  * @{
  */
#define USART_LASTBIT_DISABLE                ((uint32_t)0x0000)
#define USART_LASTBIT_ENABLE                 ((uint32_t)USART_CR2_LBCL)
#define IS_USART_LASTBIT(LASTBIT) (((LASTBIT) == USART_LASTBIT_DISABLE) || \
                                       ((LASTBIT) == USART_LASTBIT_ENABLE))
/**
  * @}
  */


/** @defgroup USART_Flags USART flag definitions
  *        Elements values convention: 0xXXXX
  *           - 0xXXXX  : Flag mask in the ISR register
  * @{
  */
#define USART_FLAG_REACK                     ((uint32_t)0x00400000)
#define USART_FLAG_TEACK                     ((uint32_t)0x00200000)  
#define USART_FLAG_BUSY                      ((uint32_t)0x00010000)
#define USART_FLAG_CTS                       ((uint32_t)0x00000400)
#define USART_FLAG_CTSIF                     ((uint32_t)0x00000200)
#define USART_FLAG_LBDF                      ((uint32_t)0x00000100)
#define USART_FLAG_TXE                       ((uint32_t)0x00000080)
#define USART_FLAG_TC                        ((uint32_t)0x00000040)
#define USART_FLAG_RXNE                      ((uint32_t)0x00000020)
#define USART_FLAG_IDLE                      ((uint32_t)0x00000010)
#define USART_FLAG_ORE                       ((uint32_t)0x00000008)
#define USART_FLAG_NE                        ((uint32_t)0x00000004)
#define USART_FLAG_FE                        ((uint32_t)0x00000002)
#define USART_FLAG_PE                        ((uint32_t)0x00000001)
/**
  * @}
  */

/** @defgroup USART_Interrupt_definition USART interrupt definition
  *        Elements values convention: 0000ZZZZ0XXYYYYYb
  *           - YYYYY  : Interrupt source position in the XX register (5bits)
  *           - XX  : Interrupt source register (2bits)
  *                 - 01: CR1 register
  *                 - 10: CR2 register
  *                 - 11: CR3 register
  *           - ZZZZ  : Flag position in the ISR register(4bits)
  * @{
  */
  
#define USART_IT_PE                          ((uint16_t)0x0028)
#define USART_IT_TXE                         ((uint16_t)0x0727)
#define USART_IT_TC                          ((uint16_t)0x0626)
#define USART_IT_RXNE                        ((uint16_t)0x0525)
#define USART_IT_IDLE                        ((uint16_t)0x0424)
#define USART_IT_ERR                         ((uint16_t)0x0060)

#define USART_IT_ORE                         ((uint16_t)0x0300)
#define USART_IT_NE                          ((uint16_t)0x0200)
#define USART_IT_FE                          ((uint16_t)0x0100)
/**
  * @}
  */

/** @defgroup USART_IT_CLEAR_Flags USART interrupt clear flags definition
  * @{
  */
#define USART_CLEAR_PEF                       USART_ICR_PECF            /*!< Parity Error Clear Flag */          
#define USART_CLEAR_FEF                       USART_ICR_FECF            /*!< Framing Error Clear Flag */         
#define USART_CLEAR_NEF                       USART_ICR_NCF             /*!< Noise detected Clear Flag */        
#define USART_CLEAR_OREF                      USART_ICR_ORECF           /*!< OverRun Error Clear Flag */         
#define USART_CLEAR_IDLEF                     USART_ICR_IDLECF          /*!< IDLE line detected Clear Flag */    
#define USART_CLEAR_TCF                       USART_ICR_TCCF            /*!< Transmission Complete Clear Flag */ 
#define USART_CLEAR_CTSF                      USART_ICR_CTSCF           /*!< CTS Interrupt Clear Flag */         
/**
  * @}
  */ 

/** @defgroup USART_Request_Parameters USART request parameter definition
  * @{
  */
#define USART_RXDATA_FLUSH_REQUEST        ((uint32_t)USART_RQR_RXFRQ)        /*!< Receive Data flush Request */ 
#define USART_TXDATA_FLUSH_REQUEST        ((uint32_t)USART_RQR_TXFRQ)        /*!< Transmit data flush Request */
#define IS_USART_REQUEST_PARAMETER(PARAM) (((PARAM) == USART_RXDATA_FLUSH_REQUEST) || \
                                           ((PARAM) == USART_TXDATA_FLUSH_REQUEST))   
/**
  * @}
  */

/** @defgroup USART_Interruption_Mask USART interruption mask definition
  * @{
  */  
#define USART_IT_MASK                             ((uint16_t)0x001F)  
/**
  * @}
  */

/**
  * @}
  */
  
    
/* Exported macro ------------------------------------------------------------*/

/** @defgroup USART_Exported_Macros USART Exported Macros
  * @{
  */
/** @brief Reset USART handle state
  * @param  __HANDLE__: specifies the USART Handle.
  *         The Handle Instance which can be USART1 or USART2.
  * @retval None
  */
#define __HAL_USART_RESET_HANDLE_STATE(__HANDLE__)  ((__HANDLE__)->State = HAL_USART_STATE_RESET)

/** @brief  Flush the USART Data registers
  * @param  __HANDLE__: specifies the USART Handle.
  */
#define __HAL_USART_FLUSH_DRREGISTER(__HANDLE__)  \
  do{                \
      SET_BIT((__HANDLE__)->Instance->RQR, USART_RXDATA_FLUSH_REQUEST); \
      SET_BIT((__HANDLE__)->Instance->RQR, USART_TXDATA_FLUSH_REQUEST); \
    } while(0)



/** @brief  Checks whether the specified USART flag is set or not.
  * @param  __HANDLE__: specifies the USART Handle which can be USART1 or USART2.
  * @param  __FLAG__: specifies the flag to check.
  *        This parameter can be one of the following values:
  *            @arg USART_FLAG_REACK: Receive enable ackowledge flag
  *            @arg USART_FLAG_TEACK: Transmit enable ackowledge flag
  *            @arg USART_FLAG_BUSY:  Busy flag                  
  *            @arg USART_FLAG_CTS:   CTS Change flag         
  *            @arg USART_FLAG_TXE:   Transmit data register empty flag
  *            @arg USART_FLAG_TC:    Transmission Complete flag
  *            @arg USART_FLAG_RXNE:  Receive data register not empty flag
  *            @arg USART_FLAG_IDLE:  Idle Line detection flag
  *            @arg USART_FLAG_ORE:   OverRun Error flag
  *            @arg USART_FLAG_NE:    Noise Error flag
  *            @arg USART_FLAG_FE:    Framing Error flag
  *            @arg USART_FLAG_PE:    Parity Error flag
  * @retval The new state of __FLAG__ (TRUE or FALSE).
  */
#define __HAL_USART_GET_FLAG(__HANDLE__, __FLAG__) (((__HANDLE__)->Instance->ISR & (__FLAG__)) == (__FLAG__))

/** @brief  Clears the specified USART pending flag.
  * @param  __HANDLE__: specifies the USART Handle.
  * @param  __FLAG__: specifies the flag to check.
  *          This parameter can be any combination of the following values:
  *            @arg USART_CLEAR_PEF
  *            @arg USART_CLEAR_FEF
  *            @arg USART_CLEAR_NEF
  *            @arg USART_CLEAR_OREF
  *            @arg USART_CLEAR_IDLEF
  *            @arg USART_CLEAR_TCF
  *            @arg USART_CLEAR_LBDF
  *            @arg USART_CLEAR_CTSF
  *            @arg USART_CLEAR_RTOF
  *            @arg USART_CLEAR_EOBF
  *            @arg USART_CLEAR_CMF
  *            @arg USART_CLEAR_WUF
  * @retval None
  */
#define __HAL_USART_CLEAR_FLAG(__HANDLE__, __FLAG__) ((__HANDLE__)->Instance->ICR = ~(__FLAG__))

/** @brief  Clear the USART PE pending flag.
  * @param  __HANDLE__: specifies the UART Handle.
  * @retval None
  */
#define __HAL_USART_CLEAR_PEFLAG(__HANDLE__)   __HAL_USART_CLEAR_FLAG(__HANDLE__,USART_CLEAR_PEF)

